rishi-latchmepersad/embedded-gauge-reading-tinyml/firmware/stm32/n657/Appli/Src/main.c
  PeriphClkInitStruct.PeriphClockSelection = RCC_PERIPHCLK_DCMIPP | RCC_PERIPHCLK_CSI;
  PeriphClkInitStruct.DcmippClockSelection = RCC_DCMIPPCLKSOURCE_IC17;
  PeriphClkInitStruct.ICSelection[RCC_IC17].ClockSelection = RCC_ICCLKSOURCE_PLL1;
  PeriphClkInitStruct.ICSelection[RCC_IC17].ClockDivider = 4;
  PeriphClkInitStruct.ICSelection[RCC_IC18].ClockSelection = RCC_ICCLKSOURCE_PLL1;
  /* 1.2 GHz / 50 = 24 MHz, which matches the IMX335 input clock setting. */
  PeriphClkInitStruct.ICSelection[RCC_IC18].ClockDivider = 50;

  if (HAL_RCCEx_PeriphCLKConfig(&PeriphClkInitStruct) != HAL_OK)
  {
    Error_Handler();
  }
}

/**
 * @brief Mark the camera DMA buffer region as non-cacheable.
 *
 * This mirrors the ST reference application, which places capture buffers in a
 * dedicated memory section and protects that section with the MPU so DCMIPP
 * writes are visible to the CPU without stale-cache effects.
 */
static void Setup_Mpu(void)
{
  MPU_Attributes_InitTypeDef attr = {0};
  MPU_Region_InitTypeDef region = {0};
  size_t noncacheable_size = (size_t)((uint8_t *)&__enoncacheable -
                                      (uint8_t *)&__snoncacheable);

  attr.Number = MPU_ATTRIBUTES_NUMBER0;
  attr.Attributes = MPU_NOT_CACHEABLE;
  HAL_MPU_ConfigMemoryAttributes(&attr);

  region.Enable = MPU_REGION_ENABLE;
  region.Number = MPU_REGION_NUMBER0;
  region.BaseAddress = (uint32_t) &__snoncacheable;
  region.LimitAddress = (uint32_t) &__enoncacheable - 1U;
  region.AttributesIndex = MPU_ATTRIBUTES_NUMBER0;
  region.AccessPermission = MPU_REGION_ALL_RW;
  region.DisableExec = MPU_INSTRUCTION_ACCESS_ENABLE;
  region.DisablePrivExec = MPU_PRIV_INSTRUCTION_ACCESS_ENABLE;
  region.IsShareable = MPU_ACCESS_NOT_SHAREABLE;
  HAL_MPU_ConfigRegion(&region);
  HAL_MPU_Enable(MPU_PRIVILEGED_DEFAULT);
  /* NOTE: do NOT memset the noncacheable buffer here — it lives at the NS alias
   * address (0x24xxxxxx) which RISAF1 may not yet be open at this point in the
   * init sequence.  The capture code fills the buffer with 0xAA sentinel before
   * each DMA, so zero-init here is not required. */
}



/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{

  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/
  HAL_Init();

#if APP_LED_ONLY_SMOKE_TEST
  MX_GPIO_Init();
  MX_LPUART1_UART_Init();
  printf("[APP] HAL_Init OK\r\n");
  App_SystemClock_Config();
  printf("[APP] App_SystemClock_Config OK\r\n");
  BSP_LED_Init(LED_RED);
  printf("[APP] Entering smoke-test blink loop\r\n");
  while (1)
  {
    BSP_LED_Toggle(LED_RED);
    HAL_Delay(100U);
  }
  return 0;
#else
  /* USER CODE BEGIN Init */
  App_SystemClock_Config();
  Setup_Mpu();

  /* USER CODE END Init */

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_LPUART1_UART_Init();
  MX_SPI5_Init();
  MX_DCMIPP_Init();
  App_CameraKernelClock_Config();
  /* The FSBL drives PWR_EN (PD10) LOW to initialise it as an output. If the
   * DS3231 or its I2C pull-up resistors are on that power rail it will be
   * unpowered when we arrive here from the FSBL boot path. Assert the pin HIGH
   * and wait for the DS3231 to complete its power-on sequence (t_VCC_SDA ≤ 1ms
   * per datasheet, 10ms to be safe) before initialising I2C1. */
  {
    GPIO_InitTypeDef pwr_gpio = {0};
    pwr_gpio.Pin   = GPIO_PIN_10;
    pwr_gpio.Mode  = GPIO_MODE_OUTPUT_PP;
    pwr_gpio.Pull  = GPIO_NOPULL;
    pwr_gpio.Speed = GPIO_SPEED_FREQ_LOW;
    __HAL_RCC_GPIOD_CLK_ENABLE();
    HAL_GPIO_Init(GPIOD, &pwr_gpio);
    HAL_GPIO_WritePin(GPIOD, GPIO_PIN_10, GPIO_PIN_SET);
    HAL_Delay(10U);
  }

  MX_I2C1_Init();
  MX_I2C2_Init();

  /* Bring up the console before the isolation setup so we can see exactly
   * which early boot step stops making progress. */
  DebugConsole_Configuration_t debug_console_configuration = { 0 };
  debug_console_configuration.uart_handle_pointer = &hlpuart1;
  debug_console_configuration.uart_transmit_timeout_milliseconds = 100U;
  debug_console_configuration.lock_callback = NULL;
  debug_console_configuration.unlock_callback = NULL;
  (void) DebugConsole_Init(&debug_console_configuration);
  DebugConsole_Printf("[BOOT] UART console initialized.\r\n");
  DS3231_LogI2c1LineState();
  DS3231_ScanI2C1Bus();

  DebugConsole_Printf("[BOOT] Entering SystemIsolation_Config().\r\n");
  SystemIsolation_Config();
  /* USER CODE BEGIN 2 */
  DebugConsole_Printf(
      "Welcome to STM32 world!\r\nApplication project is running...\r\n");
  // set up the debug leds
  DebugLed_Configuration_t debug_led_configuration = {
      .bsp_led_for_color_array = { LED_BLUE, LED_RED, LED_GREEN },
      .delay_milliseconds_callback = DelayMilliseconds_ThreadX };

  (void) DebugLed_Initialize(&debug_led_configuration);

  DS3231_LogBootTime();
  /* USER CODE END 2 */

  /* Initialize leds */
  BSP_LED_Init(LED_BLUE);
  BSP_LED_Init(LED_RED);
  BSP_LED_Init(LED_GREEN);

  /* Initialize USER push-button, will be used to trigger an interrupt each time it's pressed.*/
  BSP_PB_Init(BUTTON_USER, BUTTON_MODE_EXTI);

  MX_ThreadX_Init();

  /* USER CODE BEGIN BSP */

  /* USER CODE END BSP */

  /* We should never get here as control is now taken by the scheduler */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
	while (1) {

		/* -- Sample board code for User push-button in interrupt mode ---- */
		if (BspButtonState == BUTTON_PRESSED) {
			/* Update button state */
			BspButtonState = BUTTON_RELEASED;
			/* -- Sample board code to toggle leds ---- */
			BSP_LED_Toggle(LED_BLUE);
			BSP_LED_Toggle(LED_RED);
			BSP_LED_Toggle(LED_GREEN);

			/* ..... Perform your action ..... */
		}
    /* USER CODE END WHILE */

    /* USER CODE BEGIN 3 */
	}
  /* USER CODE END 3 */
#endif
}

/**
  * @brief DCMIPP Initialization Function
  * @param None
  * @retval None
  */
static void MX_DCMIPP_Init(void)
{
  hdcmipp.Instance = DCMIPP;
  if (HAL_DCMIPP_Init(&hdcmipp) != HAL_OK)
  {
    Error_Handler();
  }
  /* Keep CubeMX from owning a second raw PIPE0 path here.
   * The middleware configures the active camera pipe itself, and leaving this
   * function as a bare peripheral init avoids fighting that setup. */
}

/**
  * @brief I2C1 Initialization Function
  * @param None
  * @retval None
  */
static void MX_I2C1_Init(void)
{

  /* USER CODE BEGIN I2C1_Init 0 */

  /* USER CODE END I2C1_Init 0 */

