rishi-latchmepersad/embedded-gauge-reading-tinyml/firmware/stm32/n657/Appli/Src/main.c
  /* Disable all RIF security on AXISRAM1/2 so any master (including DCMIPP,
   * whose AXI transactions arrive non-secure regardless of RIMC config) can
   * read and write freely. RISC: non-secure, non-privileged. RISAF: BREN=0
   * (filter disabled — all accesses pass through). */
  HAL_RIF_RISC_SetSlaveSecureAttributes(RIF_RCC_PERIPH_INDEX_AXISRAM1,
                                        RIF_ATTRIBUTE_NPRIV);
  HAL_RIF_RISC_SetSlaveSecureAttributes(RIF_RCC_PERIPH_INDEX_AXISRAM2,
                                        RIF_ATTRIBUTE_NPRIV);

  {
    volatile uint32_t r1_cfgr;
    volatile uint32_t r2_cfgr;
    volatile uint32_t r2_cidcfgr;
    volatile uint32_t r2_startr;
    volatile uint32_t r2_endr;
    volatile uint32_t r3_cfgr;
    volatile uint32_t r3_cidcfgr;

    /* RISAF1 guards SRAM1 NS alias — disable the filter (belt-and-suspenders). */
    RISAF1_NS->REG[0].STARTR  = 0x00000000U;
    RISAF1_NS->REG[0].ENDR    = 0x000FFFFFU;
    RISAF1_NS->REG[0].CIDCFGR = 0x00000000U;
    RISAF1_NS->REG[0].CFGR    = 0x00000000U; /* BREN=0, SEC=0 — no filtering */
    RISAF1_NS->IACR            = 0xFFFFFFFFU; /* clear any stale illegal-access flags */

    /* RISAF2 guards the AXISRAM1 secure alias — disable filters so DCMIPP
     * (MSEC=1) can write to the capture buffer even when we move it to the
     * non-secure alias for this A/B test. */
    RISAF2_S->REG[0].STARTR   = 0x00000000U;
    RISAF2_S->REG[0].ENDR     = 0x000FFFFFU;
    RISAF2_S->REG[0].CIDCFGR  = 0x00000000U;
    RISAF2_S->REG[0].CFGR     = 0x00000000U; /* BREN=0 — no filtering */
    RISAF2_S->IACR             = 0xFFFFFFFFU;
    RISAF2_NS->REG[0].STARTR  = 0x00000000U;
    RISAF2_NS->REG[0].ENDR    = 0x000FFFFFU;
    RISAF2_NS->REG[0].CIDCFGR = 0x00000000U;
    RISAF2_NS->REG[0].CFGR    = 0x00000000U;
    RISAF2_NS->IACR            = 0xFFFFFFFFU;

    /* RISAF3 guards AXISRAM2 — disable the filter */
    RISAF3_NS->REG[0].STARTR  = 0x00000000U;
    RISAF3_NS->REG[0].ENDR    = 0x000FFFFFU;
    RISAF3_NS->REG[0].CIDCFGR = 0x00000000U;
    RISAF3_NS->REG[0].CFGR    = 0x00000000U; /* BREN=0, SEC=0 — no filtering */
    RISAF3_NS->IACR            = 0xFFFFFFFFU; /* clear any stale illegal-access flags */

    /* Readback to confirm writes were accepted. */
    r1_cfgr    = RISAF1_NS->REG[0].CFGR;
    r2_cfgr    = RISAF2_NS->REG[0].CFGR;
    r2_cidcfgr = RISAF2_NS->REG[0].CIDCFGR;
    r2_startr  = RISAF2_NS->REG[0].STARTR;
    r2_endr    = RISAF2_NS->REG[0].ENDR;
    r3_cfgr    = RISAF3_NS->REG[0].CFGR;
    r3_cidcfgr = RISAF3_NS->REG[0].CIDCFGR;
    DebugConsole_Printf(
        "[RIF] RISAF1 REG0: CFGR=0x%08lX (NS alias 0x24xxxxxx)\r\n",
        (unsigned long) r1_cfgr);
    DebugConsole_Printf(
        "[RIF] RISAF2 NS REG0: CFGR=0x%08lX CIDCFGR=0x%08lX STARTR=0x%08lX ENDR=0x%08lX | S CFGR=0x%08lX\r\n",
        (unsigned long) r2_cfgr, (unsigned long) r2_cidcfgr,
        (unsigned long) r2_startr, (unsigned long) r2_endr,
        (unsigned long) RISAF2_S->REG[0].CFGR);
    DebugConsole_Printf(
        "[RIF] RISAF3 REG0: CFGR=0x%08lX CIDCFGR=0x%08lX\r\n",
        (unsigned long) r3_cfgr, (unsigned long) r3_cidcfgr);
  }

  /* USER CODE END RIF_Init 1 */
  /* USER CODE BEGIN RIF_Init 2 */

  /* USER CODE END RIF_Init 2 */

}

/**
  * @brief SPI5 Initialization Function
  * @param None
  * @retval None
  */
static void MX_SPI5_Init(void)
{

  /* USER CODE BEGIN SPI5_Init 0 */

  /* USER CODE END SPI5_Init 0 */

  /* USER CODE BEGIN SPI5_Init 1 */

  /* USER CODE END SPI5_Init 1 */
  /* SPI5 parameter configuration*/
  hspi5.Instance = SPI5;
  hspi5.Init.Mode = SPI_MODE_MASTER;
  hspi5.Init.Direction = SPI_DIRECTION_2LINES;
  hspi5.Init.DataSize = SPI_DATASIZE_8BIT;
  hspi5.Init.CLKPolarity = SPI_POLARITY_LOW;
  hspi5.Init.CLKPhase = SPI_PHASE_1EDGE;
  hspi5.Init.NSS = SPI_NSS_SOFT;
  hspi5.Init.BaudRatePrescaler = SPI_BAUDRATEPRESCALER_128;
  hspi5.Init.FirstBit = SPI_FIRSTBIT_MSB;
  hspi5.Init.TIMode = SPI_TIMODE_DISABLE;
  hspi5.Init.CRCCalculation = SPI_CRCCALCULATION_DISABLE;
  hspi5.Init.CRCPolynomial = 0x7;
  hspi5.Init.NSSPMode = SPI_NSS_PULSE_DISABLE;
  hspi5.Init.NSSPolarity = SPI_NSS_POLARITY_LOW;
  hspi5.Init.FifoThreshold = SPI_FIFO_THRESHOLD_01DATA;
  hspi5.Init.MasterSSIdleness = SPI_MASTER_SS_IDLENESS_00CYCLE;
  hspi5.Init.MasterInterDataIdleness = SPI_MASTER_INTERDATA_IDLENESS_00CYCLE;
  hspi5.Init.MasterReceiverAutoSusp = SPI_MASTER_RX_AUTOSUSP_DISABLE;
  hspi5.Init.MasterKeepIOState = SPI_MASTER_KEEP_IO_STATE_DISABLE;
  hspi5.Init.IOSwap = SPI_IO_SWAP_DISABLE;
  hspi5.Init.ReadyMasterManagement = SPI_RDY_MASTER_MANAGEMENT_INTERNALLY;
  hspi5.Init.ReadyPolarity = SPI_RDY_POLARITY_HIGH;
  if (HAL_SPI_Init(&hspi5) != HAL_OK)
  {
    Error_Handler();
  }
  /* USER CODE BEGIN SPI5_Init 2 */

  /* USER CODE END SPI5_Init 2 */

}

/**
  * @brief GPIO Initialization Function
  * @param None
  * @retval None
  */
static void MX_GPIO_Init(void)
{
  GPIO_InitTypeDef GPIO_InitStruct = {0};
  /* USER CODE BEGIN MX_GPIO_Init_1 */

  /* USER CODE END MX_GPIO_Init_1 */

  /* GPIO Ports Clock Enable */
  __HAL_RCC_GPIOE_CLK_ENABLE();
  __HAL_RCC_GPIOO_CLK_ENABLE();
  __HAL_RCC_GPIOB_CLK_ENABLE();
  __HAL_RCC_GPIOG_CLK_ENABLE();
  __HAL_RCC_GPIOA_CLK_ENABLE();

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(CAM_NRST_GPIO_Port, CAM_NRST_Pin, GPIO_PIN_SET);

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(SPI5_CS_GPIO_Port, SPI5_CS_Pin, GPIO_PIN_SET);

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(CAM1_GPIO_Port, CAM1_Pin, GPIO_PIN_RESET);

  /*Configure GPIO pin : CAM_NRST_Pin */
  GPIO_InitStruct.Pin = CAM_NRST_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(CAM_NRST_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pins : SPI5_CS_Pin CAM1_Pin */
  GPIO_InitStruct.Pin = SPI5_CS_Pin|CAM1_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

  /* USER CODE BEGIN MX_GPIO_Init_2 */
  /* Keep camera module powered so the bring-up thread can probe it immediately. */
  HAL_GPIO_WritePin(CAM1_GPIO_Port, CAM1_Pin, GPIO_PIN_SET);

  /* USER CODE END MX_GPIO_Init_2 */
}

/* USER CODE BEGIN 4 */

/* USER CODE END 4 */

/**
  * @brief  Period elapsed callback in non blocking mode
  * @note   This function is called  when TIM5 interrupt took place, inside
  * HAL_TIM_IRQHandler(). It makes a direct call to HAL_IncTick() to increment
  * a global variable "uwTick" used as application time base.
  * @param  htim : TIM handle
  * @retval None
  */
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
  /* USER CODE BEGIN Callback 0 */

  /* USER CODE END Callback 0 */
  if (htim->Instance == TIM5)
  {
    HAL_IncTick();
  }
  /* USER CODE BEGIN Callback 1 */

  /* USER CODE END Callback 1 */
}

/**
  * @brief BSP Push Button callback
  * @param Button Specifies the pressed button
  * @retval None
  */
void BSP_PB_Callback(Button_TypeDef Button)
{
  if (Button == BUTTON_USER)
  {
    BspButtonState = BUTTON_PRESSED;
  }
}

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
	/* User can add his own implementation to report the HAL error return state */
	__disable_irq();
	while (1) {
	}
  /* USER CODE END Error_Handler_Debug */
}
#ifdef USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
